colus001/board-games-esp32/src/main.cpp
#include <Arduino.h>
#include <HTTPClient.h>
#include <Preferences.h>
#include <esp32_smartdisplay.h>
#include <lvgl.h>
#include <WiFi.h>
#include <WiFiClientSecure.h>

#include "common/ui_widgets.h"
#include "common/utils.h"
#include "games/chess/chess_ai.h"
#include "games/chess/chess_core.h"
#include "secrets.h"

#ifndef PAIRING_BASE_URL
#define PAIRING_BASE_URL ""
#endif

LV_FONT_DECLARE(chess_symbols_42);

namespace {
constexpr int kScreenPixels = 480;
constexpr int kStatusHeight = 32;
constexpr int kBoardPixels = kScreenPixels - kStatusHeight;
constexpr int kSquarePixels = kBoardPixels / 8;
constexpr int kBoardOffsetX = (kScreenPixels - kBoardPixels) / 2;
constexpr int kBoardOffsetY = 0;
constexpr int kHudOffsetY = kBoardOffsetY + kBoardPixels;

lv_obj_t *board_frame = nullptr;
lv_obj_t *squares[8][8];
lv_obj_t *move_markers[8][8];
lv_obj_t *piece_labels[8][8];
lv_obj_t *rank_labels[8];
lv_obj_t *file_labels[8];
lv_obj_t *status_label = nullptr;
lv_obj_t *resign_overlay = nullptr;
lv_obj_t *network_body_label = nullptr;
lv_obj_t *network_detail_label = nullptr;
lv_obj_t *lichess_progress_stage_label = nullptr;
lv_obj_t *lichess_progress_detail_label = nullptr;
lv_obj_t *lichess_progress_log_label = nullptr;
uint8_t square_ids[64];

enum class GameMode { Local, Ai, Lichess };

void show_start_screen();
void create_chessboard();
void show_game_over_overlay();
void begin_lichess_match();
void start_local_game();
void start_ai_game();
void show_ai_difficulty_screen();
void clear_selection();
void repaint_board();
void show_wifi_scan_screen();
void show_wifi_scan_results_screen();
void show_wifi_password_screen();
void show_lichess_pair_screen();
void show_lichess_progress_screen();
void update_lichess_progress(const char *stage, const char *detail);

int selected_row = -1;
int selected_col = -1;
int last_from_row = -1;
int last_from_col = -1;
int last_to_row = -1;
int last_to_col = -1;
bool white_turn = true;
bool game_over = false;
GameMode game_mode = GameMode::Local;
bool lichess_match_pending = false;
uint32_t lichess_match_start_at = 0;
const char *status_message = "White to move";
const char *game_over_title = "Game Over";
const char *game_over_subtitle = "";
String game_over_subtitle_storage;

WiFiClientSecure lichess_stream_client;
Preferences preferences;
String configured_wifi_ssid;
String configured_wifi_password;
String configured_lichess_token;
String scanned_ssids[20];
int32_t scanned_rssi[20];
int scanned_network_count = 0;
int wifi_page = 0;
uint8_t wifi_button_ids[6];
String selected_wifi_ssid;
lv_obj_t *wifi_password_textarea = nullptr;
lv_obj_t *pair_status_label = nullptr;
lv_timer_t *pair_poll_timer = nullptr;
String pair_device_id;
String lichess_username;
String lichess_game_id;
String lichess_last_moves;
String lichess_line_buffer;
String lichess_stream_error_detail;
String lichess_status_text;
String lichess_progress_log_text;
String lichess_move_error_detail;
String lichess_pending_uci;
uint32_t lichess_pending_since = 0;
uint32_t lichess_next_reconnect_at = 0;
int lichess_last_move_http_code = 0;
bool lichess_stream_headers_done = false;
bool lichess_is_white = true;
bool lichess_my_turn = false;

enum class SeekStatus {
  Matched,
  EventStreamFailed,
  SeekBeginFailed,
  SeekRejected,
  SeekUnauthorized,
  SeekForbidden,
  SeekHttpError,
  SeekStreamClosed,
  EventStreamClosed,
  Timeout,
};

struct SeekResult {
  SeekStatus status = SeekStatus::Timeout;
  String game_id;
  String detail;
  int http_code = 0;
};

void load_config() {
  preferences.begin("localchess", true);
  configured_wifi_ssid = preferences.getString("wifi_ssid", WIFI_SSID);
  configured_wifi_password = preferences.getString("wifi_pass", WIFI_PASSWORD);
  configured_lichess_token = preferences.getString("lichess", LICHESS_TOKEN);
  preferences.end();
}

void save_config(const String &ssid, const String &password, const String &token) {
  preferences.begin("localchess", false);
  preferences.putString("wifi_ssid", ssid);
  preferences.putString("wifi_pass", password);
  preferences.putString("lichess", token);
  preferences.end();
  configured_wifi_ssid = ssid;
  configured_wifi_password = password;
  configured_lichess_token = token;
}

void reset_game() {
  reset_board_position();
  selected_row = -1;
  selected_col = -1;
  last_from_row = -1;
  last_from_col = -1;
  last_to_row = -1;
  last_to_col = -1;
  white_turn = true;
  game_over = false;
  game_mode = GameMode::Local;
  status_message = "White to move";
  game_over_title = "Game Over";
  game_over_subtitle = "";
  game_over_subtitle_storage = "";
  lichess_stream_client.stop();
  lichess_game_id = "";
  lichess_last_moves = "";
  lichess_line_buffer = "";
  lichess_status_text = "";
  lichess_move_error_detail = "";
  lichess_pending_uci = "";
  lichess_pending_since = 0;
  lichess_next_reconnect_at = 0;
  lichess_last_move_http_code = 0;
  lichess_stream_headers_done = false;
  lichess_is_white = true;
  lichess_my_turn = false;
}

void start_new_game() {
  const GameMode previous_mode = game_mode;
  if (previous_mode == GameMode::Lichess) {
    begin_lichess_match();
  } else if (previous_mode == GameMode::Ai) {
    start_ai_game();
  } else {
    start_local_game();
  }
}

void start_local_game() {
  reset_game();
  game_mode = GameMode::Local;
  create_chessboard();
}

void start_ai_game() {
  reset_game();
  game_mode = GameMode::Ai;
  status_message = ai_game_status_text();
  create_chessboard();
}

bool is_current_turn_piece(char piece) {
  return white_turn ? is_white_piece(piece) : is_black_piece(piece);
}

const char *piece_text(char piece) {
  switch (piece) {
  case 'K':
    return "♔";
  case 'Q':
    return "♕";
  case 'R':
    return "♖";
  case 'B':
    return "♗";
  case 'N':
    return "♘";
  case 'P':
    return "♙";
  case 'k':
    return "♚";
  case 'q':
    return "♛";
  case 'r':
    return "♜";
  case 'b':
    return "♝";
  case 'n':
    return "♞";
  case 'p':
    return "♟";
  default:
    return "";
  }
}

void set_dynamic_status(const String &message) {
  lichess_status_text = message;
  status_message = lichess_status_text.c_str();
}

