colus001/board-games-esp32/src/main.cpp
void set_lichess_turn_status() {
  const char *side = lichess_is_white ? "White" : "Black";
  const char *turn = white_turn ? "White" : "Black";
  if (lichess_my_turn) {
    set_dynamic_status(String("You: ") + side + " | Your move");
  } else {
    set_dynamic_status(String("You: ") + side + " | " + turn + " to move");
  }
}

bool wifi_configured() {
  return configured_wifi_ssid.length() > 0;
}

bool lichess_token_configured() {
  return configured_lichess_token.length() > 0;
}

bool board_flipped() {
  return game_mode == GameMode::Lichess && !lichess_is_white;
}

int board_to_display_row(int row) {
  return board_flipped() ? 7 - row : row;
}

int board_to_display_col(int col) {
  return board_flipped() ? 7 - col : col;
}

const char *configured_text(bool configured) {
  return configured ? "configured" : "missing";
}

int file_to_col(char file) {
  return file - 'a';
}

int rank_to_row(char rank) {
  return '8' - rank;
}

void clear_last_move() {
  last_from_row = -1;
  last_from_col = -1;
  last_to_row = -1;
  last_to_col = -1;
}

void set_last_move(int from_row, int from_col, int to_row, int to_col) {
  last_from_row = from_row;
  last_from_col = from_col;
  last_to_row = to_row;
  last_to_col = to_col;
}

void set_last_move_from_uci(const String &move) {
  if (move.length() < 4) {
    clear_last_move();
    return;
  }

  const int from_col = file_to_col(move[0]);
  const int from_row = rank_to_row(move[1]);
  const int to_col = file_to_col(move[2]);
  const int to_row = rank_to_row(move[3]);
  if (from_row < 0 || from_row > 7 || from_col < 0 || from_col > 7 || to_row < 0 || to_row > 7 || to_col < 0 || to_col > 7) {
    clear_last_move();
    return;
  }

  set_last_move(from_row, from_col, to_row, to_col);
}

bool is_last_move_from_square(int row, int col) {
  return row == last_from_row && col == last_from_col;
}

bool is_last_move_to_square(int row, int col) {
  return row == last_to_row && col == last_to_col;
}

String uci_from_move(int from_row, int from_col, int to_row, int to_col) {
  String move;
  move += char('a' + from_col);
  move += char('8' - from_row);
  move += char('a' + to_col);
  move += char('8' - to_row);
  const char piece = board[from_row][from_col];
  if (lower_piece(piece) == 'p' && (to_row == 0 || to_row == 7)) {
    move += 'q';
  }
  return move;
}

void apply_lichess_moves(const String &moves) {
  reset_board_position();
  int move_count = 0;
  int start = 0;
  String last_move;

  while (start < moves.length()) {
    while (start < moves.length() && moves[start] == ' ') {
      ++start;
    }
    if (start >= moves.length()) {
      break;
    }
    int end = moves.indexOf(' ', start);
    if (end < 0) {
      end = moves.length();
    }
    last_move = moves.substring(start, end);
    apply_uci_move(last_move);
    ++move_count;
    start = end + 1;
  }

  clear_selection();
  if (move_count > 0) {
    set_last_move_from_uci(last_move);
  } else {
    clear_last_move();
  }
  white_turn = (move_count % 2) == 0;
  lichess_my_turn = white_turn == lichess_is_white;
  set_lichess_turn_status();
}

bool connect_wifi() {
  if (WiFi.status() == WL_CONNECTED) {
    return true;
  }

  WiFi.mode(WIFI_STA);
  WiFi.begin(configured_wifi_ssid.c_str(), configured_wifi_password.c_str());
  const unsigned long started = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - started < 15000) {
    lv_timer_handler();
    delay(100);
  }
  return WiFi.status() == WL_CONNECTED;
}

void stop_pair_poll_timer() {
  if (!pair_poll_timer) {
    return;
  }
  lv_timer_delete(pair_poll_timer);
  pair_poll_timer = nullptr;
}

bool start_pairing_session(String &device_id, String &pair_code, String &pair_url) {
  if (String(PAIRING_BASE_URL).length() == 0) {
    return false;
  }

  WiFiClientSecure client;
  client.setInsecure();
  HTTPClient http;
  if (!http.begin(client, String(PAIRING_BASE_URL) + "/api/pair/start")) {
    return false;
  }
  http.addHeader("Accept", "application/json");
  const int code = http.POST("");
  const String body = http.getString();
  http.end();
  if (code < 200 || code >= 300) {
    return false;
  }

  device_id = json_string_value(body, "deviceId");
  pair_code = json_string_value(body, "pairCode");
  pair_url = json_string_value(body, "pairUrl");
  return device_id.length() > 0 && pair_code.length() > 0 && pair_url.length() > 0;
}

String pairing_status_body() {
  WiFiClientSecure client;
  client.setInsecure();
  HTTPClient http;
  if (!http.begin(client, String(PAIRING_BASE_URL) + "/api/pair/status?deviceId=" + pair_device_id)) {
    return "";
  }
  http.addHeader("Accept", "application/json");
  const int code = http.GET();
  const String body = http.getString();
  http.end();
  if (code < 200 || code >= 300) {
    return "";
  }
  return body;
}

void update_network_status(const char *message, const char *detail) {
  if (network_body_label) {
    lv_label_set_text(network_body_label, message);
  }
  if (network_detail_label) {
    lv_label_set_text(network_detail_label, detail);
  }
  if (lichess_progress_stage_label) {
    lv_label_set_text(lichess_progress_stage_label, message);
  }
  if (lichess_progress_detail_label) {
    lv_label_set_text(lichess_progress_detail_label, detail);
  }
  lv_timer_handler();
}

void lichess_log(const String &message) {
  Serial.println(message);
  if (lichess_progress_log_text.length() > 0) {
    lichess_progress_log_text += "\n";
  }
  lichess_progress_log_text += message;

  int line_count = 0;
  for (int i = lichess_progress_log_text.length() - 1; i >= 0; --i) {
    if (lichess_progress_log_text[i] == '\n') {
      ++line_count;
      if (line_count >= 7) {
        lichess_progress_log_text = lichess_progress_log_text.substring(i + 1);
        break;
      }
    }
  }

  if (lichess_progress_log_label) {
    lv_label_set_text(lichess_progress_log_label, lichess_progress_log_text.c_str());
  }
  lv_timer_handler();
}

void update_lichess_progress(const char *stage, const char *detail) {
  update_network_status(stage, detail);
  lichess_log(String(stage) + " - " + detail);
}

bool load_lichess_account() {
  WiFiClientSecure client;
  client.setInsecure();
  HTTPClient http;
  if (!http.begin(client, "https://lichess.org/api/account")) {
    return false;
  }
  http.addHeader("Authorization", String("Bearer ") + configured_lichess_token);
  http.addHeader("Accept", "application/json");
  const int code = http.GET();
  const String body = http.getString();
  http.end();

  Serial.printf("Lichess account HTTP code: %d\n", code);

  if (code != 200) {
    return false;
  }

  lichess_username = lower_string(json_string_value(body, "username"));
  return lichess_username.length() > 0;
}

const char *seek_status_text(const SeekResult &result) {
  switch (result.status) {
  case SeekStatus::EventStreamFailed:
    return "Event stream failed";
  case SeekStatus::SeekBeginFailed:
    return "Could not start seek";
  case SeekStatus::SeekRejected:
    return "Seek rejected by Lichess";
  case SeekStatus::SeekUnauthorized:
    return "Lichess token unauthorized";
  case SeekStatus::SeekForbidden:
    return "Token missing board:play";
  case SeekStatus::SeekHttpError:
    return "Lichess seek error";
  case SeekStatus::SeekStreamClosed:
    return "Seek stream closed";
  case SeekStatus::EventStreamClosed:
    return "Event stream closed";
  case SeekStatus::Timeout:
    return "No match after 90 sec";
  case SeekStatus::Matched:
    return "Matched";
  }
  return "Match failed";
}

SeekResult seek_lichess_game() {
  SeekResult result;
  update_network_status("Opening event stream...", "Waiting for Lichess events");
  WiFiClientSecure event_client;
  event_client.setInsecure();
  event_client.setTimeout(5);
  if (!event_client.connect("lichess.org", 443)) {
    Serial.println("Lichess event stream connect failed");
    result.status = SeekStatus::EventStreamFailed;
    return result;
  }
  Serial.println("Lichess event stream connected");

  event_client.print("GET /api/stream/event HTTP/1.1\r\n");
  event_client.print("Host: lichess.org\r\n");
  event_client.print(String("Authorization: Bearer ") + configured_lichess_token + "\r\n");
  event_client.print("Accept: application/x-ndjson\r\n");
  event_client.print("Connection: keep-alive\r\n\r\n");

  update_network_status("Creating seek...", "Casual 10+0 / random color");
  WiFiClientSecure seek_client;
  seek_client.setInsecure();
  seek_client.setTimeout(5);
  if (!seek_client.connect("lichess.org", 443)) {
    event_client.stop();
    Serial.println("Lichess seek stream connect failed");
    result.status = SeekStatus::SeekBeginFailed;
    return result;
  }

