colus001/board-games-esp32/src/main.cpp
  const String seek_body = "rated=false&time=10&increment=0&color=random";
  seek_client.print("POST /api/board/seek HTTP/1.1\r\n");
  seek_client.print("Host: lichess.org\r\n");
  seek_client.print(String("Authorization: Bearer ") + configured_lichess_token + "\r\n");
  seek_client.print("Accept: application/x-ndjson\r\n");
  seek_client.print("Content-Type: application/x-www-form-urlencoded\r\n");
  seek_client.print(String("Content-Length: ") + seek_body.length() + "\r\n");
  seek_client.print("Connection: keep-alive\r\n\r\n");
  seek_client.print(seek_body);

  String status_line;
  if (!read_http_line(seek_client, status_line, 15000)) {
    event_client.stop();
    seek_client.stop();
    Serial.println("Lichess seek status timeout");
    result.status = SeekStatus::SeekHttpError;
    result.detail = "No seek HTTP response";
    return result;
  }

  const int code = parse_http_status_code(status_line);
  result.http_code = code;
  Serial.printf("Lichess seek status: %s\n", status_line.c_str());
  Serial.printf("Lichess seek HTTP code: %d\n", code);

  String header_line;
  while (read_http_line(seek_client, header_line, 5000)) {
    if (header_line.length() == 0) {
      break;
    }
  }

  if (code < 200 || code >= 300) {
    String error_body;
    const unsigned long error_started = millis();
    while (millis() - error_started < 2000) {
      while (seek_client.available()) {
        const char c = seek_client.read();
        if (error_body.length() < 300) {
          error_body += c;
        }
      }
      if (!seek_client.connected()) {
        break;
      }
      delay(10);
    }
    result.detail = compact_error_detail(error_body);
    Serial.printf("Lichess seek error body: %.220s\n", error_body.c_str());
  }
  if (code < 200 || code >= 300) {
    event_client.stop();
    seek_client.stop();
    if (code == 400) {
      result.status = SeekStatus::SeekRejected;
    } else if (code == 401) {
      result.status = SeekStatus::SeekUnauthorized;
    } else if (code == 403) {
      result.status = SeekStatus::SeekForbidden;
    } else {
      result.status = SeekStatus::SeekHttpError;
    }
    return result;
  }

  update_network_status("Waiting for opponent...", "This can take up to 90 seconds");
  bool headers_done = false;
  bool seek_closed = false;
  String line;
  const unsigned long started = millis();
  unsigned long last_update = 0;
  unsigned long seek_closed_at = 0;
  while (millis() - started < 90000) {
    if (!event_client.connected()) {
      event_client.stop();
      seek_client.stop();
      Serial.println("Lichess event stream closed before match");
      result.status = SeekStatus::EventStreamClosed;
      return result;
    }

    if (!seek_closed) {
      while (seek_client.available()) {
        seek_client.read();
      }
      if (!seek_client.connected()) {
        seek_closed = true;
        seek_closed_at = millis();
        Serial.println("Lichess seek stream closed before gameStart event");
        update_network_status("Waiting for opponent...", "Seek closed; checking events...");
      }
    } else if (millis() - seek_closed_at > 5000) {
      event_client.stop();
      seek_client.stop();
      result.status = SeekStatus::SeekStreamClosed;
      result.detail = "Seek expired or was canceled";
      return result;
    }

    const unsigned long elapsed = (millis() - started) / 1000;
    if (millis() - last_update > 5000) {
      last_update = millis();
      String detail = String("Still waiting... ") + String(elapsed) + "s / 90s";
      update_network_status("Waiting for opponent...", detail.c_str());
    }

    while (event_client.available()) {
      const char c = event_client.read();
      if (c == '\r') {
        continue;
      }
      if (c == '\n') {
        if (!headers_done) {
          headers_done = line.length() == 0;
        } else if (line.length() > 0) {
          Serial.printf("Lichess event: %.220s\n", line.c_str());
          if (line.indexOf("gameStart") >= 0) {
            const String game_id = json_string_value(line, "gameId");
            if (game_id.length() > 0) {
              const String color = json_string_value(line, "color");
              if (color == "white") {
                lichess_is_white = true;
              } else if (color == "black") {
                lichess_is_white = false;
              }
              event_client.stop();
              seek_client.stop();
              Serial.printf("Lichess matched game id: %s\n", game_id.c_str());
              result.status = SeekStatus::Matched;
              result.game_id = game_id;
              return result;
            }
          }
        }
        line = "";
      } else if (line.length() < 1200) {
        line += c;
      }
    }

    lv_timer_handler();
    delay(20);
  }

  event_client.stop();
  seek_client.stop();
  Serial.println("Lichess seek timed out after 90 seconds");
  result.status = SeekStatus::Timeout;
  return result;
}

bool lichess_post(const String &path) {
  lichess_move_error_detail = "";
  lichess_last_move_http_code = 0;
  WiFiClientSecure client;
  client.setInsecure();
  HTTPClient http;
  if (!http.begin(client, String("https://lichess.org") + path)) {
    lichess_move_error_detail = "HTTP begin failed";
    return false;
  }
  http.addHeader("Authorization", String("Bearer ") + configured_lichess_token);
  const int code = http.POST("");
  const String body = http.getString();
  http.end();
  lichess_last_move_http_code = code;
  Serial.printf("Lichess POST %s -> HTTP %d\n", path.c_str(), code);
  if (body.length() > 0) {
    Serial.printf("Lichess POST body: %.220s\n", body.c_str());
  }
  if (code < 200 || code >= 300) {
    lichess_move_error_detail = String("HTTP ") + String(code);
    const String compact = compact_error_detail(body);
    if (compact.length() > 0) {
      lichess_move_error_detail += String(": ") + compact;
    }
  }
  return code >= 200 && code < 300;
}

bool connect_lichess_stream() {
  lichess_stream_error_detail = "";
  lichess_stream_client.stop();
  lichess_stream_client.setInsecure();
  lichess_stream_client.setTimeout(5);
  if (!lichess_stream_client.connect("lichess.org", 443)) {
    Serial.println("Lichess game stream TCP connect failed");
    lichess_stream_error_detail = "TCP connect failed";
    return false;
  }

  lichess_stream_client.print(String("GET /api/board/game/stream/") + lichess_game_id + " HTTP/1.1\r\n");
  lichess_stream_client.print("Host: lichess.org\r\n");
  lichess_stream_client.print(String("Authorization: Bearer ") + configured_lichess_token + "\r\n");
  lichess_stream_client.print("Accept: application/x-ndjson\r\n");
  lichess_stream_client.print("Connection: keep-alive\r\n\r\n");

  String status_line;
  if (!read_http_line(lichess_stream_client, status_line, 15000)) {
    Serial.println("Lichess game stream status timeout");
    lichess_stream_error_detail = "HTTP status timeout";
    lichess_stream_client.stop();
    return false;
  }

