colus001/board-games-esp32/src/main.cpp
  const int status_code = parse_http_status_code(status_line);
  Serial.printf("Lichess game stream status: %s\n", status_line.c_str());
  if (status_code != 200) {
    String header_line;
    while (read_http_line(lichess_stream_client, header_line, 1000)) {
      if (header_line.length() == 0) {
        break;
      }
    }
    String error_body;
    const unsigned long started = millis();
    while (millis() - started < 1000) {
      while (lichess_stream_client.available()) {
        const char c = lichess_stream_client.read();
        if (error_body.length() < 220) {
          error_body += c;
        }
      }
      delay(10);
    }
    Serial.printf("Lichess game stream error body: %.220s\n", error_body.c_str());
    lichess_stream_error_detail = String("HTTP ") + String(status_code);
    const String compact = compact_error_detail(error_body);
    if (compact.length() > 0) {
      lichess_stream_error_detail += String(": ") + compact;
    }
    lichess_stream_client.stop();
    return false;
  }

  String header_line;
  while (read_http_line(lichess_stream_client, header_line, 5000)) {
    if (header_line.length() == 0) {
      break;
    }
  }

  lichess_stream_headers_done = true;
  lichess_line_buffer = "";
  lichess_next_reconnect_at = 0;
  return true;
}

void update_lichess_side_from_game(const String &line) {
  const String lower_line = lower_string(line);
  const int white_pos = lower_line.indexOf("\"white\"");
  const int black_pos = lower_line.indexOf("\"black\"");
  const String id_needle = String("\"id\":\"") + lichess_username + "\"";
  const String name_needle = String("\"name\":\"") + lichess_username + "\"";

  if (white_pos >= 0 && (black_pos < 0 || white_pos < black_pos)) {
    const String white_section = lower_line.substring(white_pos, black_pos < 0 ? lower_line.length() : black_pos);
    if (white_section.indexOf(id_needle) >= 0 || white_section.indexOf(name_needle) >= 0) {
      lichess_is_white = true;
    }
  }
  if (black_pos >= 0) {
    const String black_section = lower_line.substring(black_pos);
    if (black_section.indexOf(id_needle) >= 0 || black_section.indexOf(name_needle) >= 0) {
      lichess_is_white = false;
    }
  }
}

void handle_lichess_stream_line(const String &line) {
  if (line.length() == 0) {
    return;
  }

  Serial.printf("Lichess game stream: %.220s\n", line.c_str());

  const String event_type = json_string_value(line, "type");
  const bool game_full = event_type == "gameFull";
  const bool game_state = event_type == "gameState";
  const bool opponent_gone = event_type == "opponentGone";

  if (opponent_gone) {
    set_dynamic_status("Opponent disconnected");
    repaint_board();
    return;
  }

  if (game_full) {
    const bool was_flipped = board_flipped();
    update_lichess_side_from_game(line);
    if (board_flipped() != was_flipped) {
      create_chessboard();
    }
    set_dynamic_status(String("Game connected | You: ") + (lichess_is_white ? "White" : "Black"));
  }

  const bool has_moves = json_has_string_key(line, "moves");
  String moves = has_moves ? json_string_value(line, "moves") : "";
  if (has_moves && (game_full || game_state || moves != lichess_last_moves)) {
    Serial.printf("Applying Lichess moves: %.220s\n", moves.c_str());
    lichess_last_moves = moves;
    apply_lichess_moves(moves);
    if (lichess_pending_uci.length() > 0 && (String(" ") + moves + " ").indexOf(String(" ") + lichess_pending_uci + " ") >= 0) {
      Serial.printf("Lichess move synced: %s\n", lichess_pending_uci.c_str());
      lichess_pending_uci = "";
      lichess_pending_since = 0;
    }
    repaint_board();
  } else if (!has_moves) {
    Serial.println("Lichess stream line has no moves; board unchanged");
  }

  const String status = json_string_value(line, "status");
  if (status == "started" || status.length() == 0) {
    return;
  }

  if (status == "mate" || status == "resign" || status == "timeout" || status == "draw" || status == "stalemate" || status == "aborted") {
    game_over = true;
    game_over_title = status == "draw" || status == "stalemate" ? "Game drawn" : "Game over";
    if (status == "mate") {
      game_over_subtitle = "Checkmate";
    } else if (status == "resign") {
      game_over_subtitle = "Resignation";
    } else if (status == "timeout") {
      game_over_subtitle = "Timeout";
    } else if (status == "stalemate") {
      game_over_subtitle = "Stalemate";
    } else if (status == "aborted") {
      if (lichess_pending_uci.length() > 0) {
        game_over_subtitle_storage = String("Aborted before sync: ") + lichess_pending_uci;
        game_over_subtitle = game_over_subtitle_storage.c_str();
      } else {
        game_over_subtitle = "Aborted";
      }
    } else {
      game_over_subtitle = "Draw";
    }
    set_dynamic_status(String("Lichess game over: ") + status);
    repaint_board();
    show_game_over_overlay();
  }
}

void poll_lichess_stream() {
  if (game_mode != GameMode::Lichess || lichess_game_id.length() == 0 || game_over) {
    return;
  }
  if (!lichess_stream_client.connected()) {
    const uint32_t now = millis();
    if (lichess_next_reconnect_at != 0 && now < lichess_next_reconnect_at) {
      return;
    }
    lichess_next_reconnect_at = now + 5000;
    set_dynamic_status("Stream reconnecting...");
    repaint_board();
    if (!connect_lichess_stream()) {
      if (lichess_stream_error_detail.length() > 0) {
        set_dynamic_status(lichess_stream_error_detail);
      } else {
        set_dynamic_status("Stream reconnect failed");
      }
      repaint_board();
    } else {
      set_dynamic_status("Stream reconnected");
      repaint_board();
    }
    return;
  }

  if (lichess_pending_uci.length() > 0 && millis() - lichess_pending_since > 8000) {
    set_dynamic_status(String("Still waiting sync: ") + lichess_pending_uci);
    repaint_board();
    lichess_pending_since = millis();
  }

  while (lichess_stream_client.available()) {
    const char c = lichess_stream_client.read();
    if (c == '\r') {
      continue;
    }
    if (c == '\n') {
      if (!lichess_stream_headers_done) {
        if (lichess_line_buffer.length() == 0) {
          lichess_stream_headers_done = true;
        }
      } else {
        handle_lichess_stream_line(lichess_line_buffer);
      }
      lichess_line_buffer = "";
    } else if (lichess_line_buffer.length() < 1200) {
      lichess_line_buffer += c;
    }
  }
}

bool has_selection() {
  return selected_row >= 0 && selected_col >= 0;
}

