colus001/board-games-esp32/src/main.cpp
bool is_legal_destination(int row, int col) {
  return has_selection() && is_legal_move(selected_row, selected_col, row, col);
}

void update_status() {
  lv_label_set_text_fmt(status_label, "%s", status_message);
}

void paint_square(int row, int col) {
  const bool selected = row == selected_row && col == selected_col;
  const bool last_move_from = is_last_move_from_square(row, col);
  const bool last_move_to = is_last_move_to_square(row, col);
  const bool legal_destination = is_legal_destination(row, col);
  const bool capture_destination = legal_destination && board[row][col] != '.';
  const bool light_square = is_light_square(row, col);
  const lv_color_t color = selected
                               ? light_square ? lv_color_hex(0xC9D19D) : lv_color_hex(0x6F8C70)
                               : light_square
                                     ? lv_color_hex(0xEEEED2)
                                     : lv_color_hex(0x4F7EA5);

  lv_obj_set_style_bg_color(squares[row][col], color, LV_PART_MAIN);
  lv_obj_set_style_bg_opa(squares[row][col], LV_OPA_COVER, LV_PART_MAIN);
  if (!selected && (last_move_from || last_move_to)) {
    lv_obj_set_style_border_width(squares[row][col], last_move_to ? 4 : 3, LV_PART_MAIN);
    lv_obj_set_style_border_color(squares[row][col], lv_color_hex(0xE6C85C), LV_PART_MAIN);
    lv_obj_set_style_border_opa(squares[row][col], last_move_to ? LV_OPA_90 : LV_OPA_70, LV_PART_MAIN);
  } else {
    lv_obj_set_style_border_width(squares[row][col], 0, LV_PART_MAIN);
  }

  if (legal_destination) {
    lv_obj_remove_flag(move_markers[row][col], LV_OBJ_FLAG_HIDDEN);
    lv_obj_set_style_radius(move_markers[row][col], LV_RADIUS_CIRCLE, LV_PART_MAIN);
    lv_obj_set_style_border_color(move_markers[row][col], lv_color_hex(0x5D6F3A), LV_PART_MAIN);
    lv_obj_set_style_border_opa(move_markers[row][col], LV_OPA_70, LV_PART_MAIN);
    lv_obj_set_style_bg_color(move_markers[row][col], lv_color_hex(0x5D6F3A), LV_PART_MAIN);

    if (capture_destination) {
      lv_obj_set_size(move_markers[row][col], 50, 50);
      lv_obj_set_style_bg_opa(move_markers[row][col], LV_OPA_TRANSP, LV_PART_MAIN);
      lv_obj_set_style_border_width(move_markers[row][col], 4, LV_PART_MAIN);
    } else {
      lv_obj_set_size(move_markers[row][col], 15, 15);
      lv_obj_set_style_bg_opa(move_markers[row][col], LV_OPA_60, LV_PART_MAIN);
      lv_obj_set_style_border_width(move_markers[row][col], 0, LV_PART_MAIN);
    }
    lv_obj_center(move_markers[row][col]);
  } else {
    lv_obj_add_flag(move_markers[row][col], LV_OBJ_FLAG_HIDDEN);
  }

  const char piece = board[row][col];
  const bool white_piece = is_white_piece(piece);

  lv_label_set_text(piece_labels[row][col], piece_text(piece));
  lv_obj_set_style_text_color(piece_labels[row][col],
                              white_piece ? lv_color_hex(0xFFD166) : lv_color_hex(0x1F2933),
                              LV_PART_MAIN);

  if (board_to_display_col(col) == 0) {
    lv_obj_set_style_text_color(rank_labels[row],
                                light_square ? lv_color_hex(0x4F7EA5) : lv_color_hex(0xEEEED2),
                                LV_PART_MAIN);
  }
  if (board_to_display_row(row) == 7) {
    lv_obj_set_style_text_color(file_labels[col],
                                light_square ? lv_color_hex(0x4F7EA5) : lv_color_hex(0xEEEED2),
                                LV_PART_MAIN);
  }
}

void repaint_board() {
  for (int row = 0; row < 8; ++row) {
    for (int col = 0; col < 8; ++col) {
      paint_square(row, col);
    }
  }
  update_status();
}

void clear_selection() {
  selected_row = -1;
  selected_col = -1;
}

void set_turn_status() {
  if (is_in_check(white_turn)) {
    status_message = white_turn ? "White in check" : "Black in check";
  } else {
    status_message = white_turn ? "White to move" : "Black to move";
  }
}

void select_square(int row, int col) {
  selected_row = row;
  selected_col = col;
  status_message = white_turn ? "White selected" : "Black selected";
}

void move_piece(int from_row, int from_col, int to_row, int to_col) {
  board[to_row][to_col] = board[from_row][from_col];
  board[from_row][from_col] = '.';
  set_last_move(from_row, from_col, to_row, to_col);
  white_turn = !white_turn;
  clear_selection();

  const bool in_check = is_in_check(white_turn);
  const bool has_move = has_any_legal_move(white_turn);
  if (!has_move && in_check) {
    game_over = true;
    game_over_title = "Checkmate";
    game_over_subtitle = white_turn ? "Black wins" : "White wins";
    status_message = white_turn ? "Checkmate - Black wins" : "Checkmate - White wins";
  } else if (!has_move) {
    game_over = true;
    game_over_title = "Stalemate";
    game_over_subtitle = "Draw";
    status_message = "Stalemate - Draw";
  } else {
    set_turn_status();
  }
}

void make_ai_move_if_needed() {
  if (game_mode != GameMode::Ai || game_over || white_turn) {
    return;
  }

  status_message = ai_thinking_text();
  repaint_board();
  lv_timer_handler();

  const unsigned long started = millis();
  const ChessMove ai_move = choose_ai_move(false);
  while (millis() - started < static_cast<unsigned long>(ai_minimum_think_ms())) {
    lv_timer_handler();
    delay(20);
  }
  if (ai_move.from_row < 0) {
    game_over = true;
    game_over_title = is_in_check(false) ? "Checkmate" : "Stalemate";
    game_over_subtitle = is_in_check(false) ? "White wins" : "Draw";
    status_message = is_in_check(false) ? "Checkmate - White wins" : "Stalemate - Draw";
    return;
  }

  move_piece(ai_move.from_row, ai_move.from_col, ai_move.to_row, ai_move.to_col);
}

void on_start_clicked(lv_event_t *event) {
  (void)event;
  start_local_game();
}

void on_ai_game_clicked(lv_event_t *event) {
  (void)event;
  show_ai_difficulty_screen();
}

void on_ai_easy_clicked(lv_event_t *event) {
  (void)event;
  set_ai_difficulty(AiDifficulty::Easy);
  start_ai_game();
}

void on_ai_normal_clicked(lv_event_t *event) {
  (void)event;
  set_ai_difficulty(AiDifficulty::Normal);
  start_ai_game();
}

