colus001/board-games-esp32/src/main.cpp
void on_ai_hard_clicked(lv_event_t *event) {
  (void)event;
  set_ai_difficulty(AiDifficulty::Hard);
  start_ai_game();
}

void on_new_game_clicked(lv_event_t *event) {
  (void)event;
  start_new_game();
}

void on_title_clicked(lv_event_t *event) {
  (void)event;
  stop_pair_poll_timer();
  reset_game();
  show_start_screen();
}

void show_ai_difficulty_screen() {
  lv_obj_t *screen = lv_screen_active();
  lv_obj_clean(screen);
  lv_obj_set_style_bg_color(screen, lv_color_hex(0x17202A), LV_PART_MAIN);

  lv_obj_t *card = lv_obj_create(screen);
  lv_obj_remove_style_all(card);
  lv_obj_set_size(card, 392, 392);
  lv_obj_center(card);
  lv_obj_set_style_radius(card, 24, LV_PART_MAIN);
  lv_obj_set_style_bg_color(card, lv_color_hex(0xF1E1BB), LV_PART_MAIN);
  lv_obj_set_style_bg_opa(card, LV_OPA_COVER, LV_PART_MAIN);
  lv_obj_set_style_border_width(card, 4, LV_PART_MAIN);
  lv_obj_set_style_border_color(card, lv_color_hex(0x9FBAD0), LV_PART_MAIN);

  lv_obj_t *title = lv_label_create(card);
  lv_label_set_text(title, "Choose AI Level");
  lv_obj_set_style_text_font(title, &lv_font_montserrat_28, LV_PART_MAIN);
  lv_obj_set_style_text_color(title, lv_color_hex(0x263526), LV_PART_MAIN);
  lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 28);

  lv_obj_t *subtitle = lv_label_create(card);
  lv_label_set_text(subtitle, "You play White");
  lv_obj_set_style_text_font(subtitle, &lv_font_montserrat_20, LV_PART_MAIN);
  lv_obj_set_style_text_color(subtitle, lv_color_hex(0x5E3F2A), LV_PART_MAIN);
  lv_obj_align(subtitle, LV_ALIGN_TOP_MID, 0, 76);

  lv_obj_t *easy = create_menu_button(card, "Easy", 300, 54);
  lv_obj_align(easy, LV_ALIGN_TOP_MID, 0, 126);
  lv_obj_add_event_cb(easy, on_ai_easy_clicked, LV_EVENT_CLICKED, nullptr);

  lv_obj_t *normal = create_menu_button(card, "Normal", 300, 54);
  lv_obj_align(normal, LV_ALIGN_TOP_MID, 0, 192);
  lv_obj_add_event_cb(normal, on_ai_normal_clicked, LV_EVENT_CLICKED, nullptr);

  lv_obj_t *hard = create_menu_button(card, "Hard", 300, 54);
  lv_obj_align(hard, LV_ALIGN_TOP_MID, 0, 258);
  lv_obj_add_event_cb(hard, on_ai_hard_clicked, LV_EVENT_CLICKED, nullptr);

  lv_obj_t *back = create_menu_button(card, "Back", 150, 46);
  lv_obj_align(back, LV_ALIGN_BOTTOM_MID, 0, -18);
  lv_obj_add_event_cb(back, on_title_clicked, LV_EVENT_CLICKED, nullptr);
}

void show_game_over_overlay() {
  lv_obj_t *screen = lv_screen_active();
  lv_obj_t *overlay = lv_obj_create(screen);
  lv_obj_remove_style_all(overlay);
  lv_obj_set_size(overlay, kScreenPixels, kScreenPixels);
  lv_obj_set_pos(overlay, 0, 0);
  lv_obj_set_style_bg_color(overlay, lv_color_hex(0x11110F), LV_PART_MAIN);
  lv_obj_set_style_bg_opa(overlay, LV_OPA_60, LV_PART_MAIN);
  lv_obj_add_flag(overlay, LV_OBJ_FLAG_CLICKABLE);

  lv_obj_t *panel = lv_obj_create(overlay);
  lv_obj_remove_style_all(panel);
  lv_obj_set_size(panel, 348, 224);
  lv_obj_center(panel);
  lv_obj_set_style_radius(panel, 20, LV_PART_MAIN);
  lv_obj_set_style_bg_color(panel, lv_color_hex(0xF1E1BB), LV_PART_MAIN);
  lv_obj_set_style_bg_opa(panel, LV_OPA_COVER, LV_PART_MAIN);
  lv_obj_set_style_border_width(panel, 4, LV_PART_MAIN);
  lv_obj_set_style_border_color(panel, lv_color_hex(0x34495E), LV_PART_MAIN);

  lv_obj_t *title = lv_label_create(panel);
  lv_label_set_text(title, game_over_title);
  lv_obj_set_style_text_font(title, &lv_font_montserrat_28, LV_PART_MAIN);
  lv_obj_set_style_text_color(title, lv_color_hex(0x263526), LV_PART_MAIN);
  lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 22);

  lv_obj_t *subtitle = lv_label_create(panel);
  lv_label_set_text(subtitle, game_over_subtitle);
  lv_obj_set_style_text_font(subtitle, &lv_font_montserrat_20, LV_PART_MAIN);
  lv_obj_set_style_text_color(subtitle, lv_color_hex(0x5E3F2A), LV_PART_MAIN);
  lv_obj_align(subtitle, LV_ALIGN_TOP_MID, 0, 66);

  lv_obj_t *new_game = create_menu_button(panel, "New Game", 142, 52);
  lv_obj_align(new_game, LV_ALIGN_BOTTOM_LEFT, 26, -24);
  lv_obj_add_event_cb(new_game, on_new_game_clicked, LV_EVENT_CLICKED, nullptr);

  lv_obj_t *title_button = create_menu_button(panel, "Title", 142, 52);
  lv_obj_align(title_button, LV_ALIGN_BOTTOM_RIGHT, -26, -24);
  lv_obj_add_event_cb(title_button, on_title_clicked, LV_EVENT_CLICKED, nullptr);
}

void finish_by_resignation() {
  const bool white_resigned = white_turn;
  if (game_mode == GameMode::Lichess && lichess_game_id.length() > 0) {
    lichess_post(String("/api/board/game/") + lichess_game_id + "/resign");
  }
  clear_selection();
  game_over = true;
  game_over_title = "Resignation";
  game_over_subtitle = white_resigned ? "Black wins" : "White wins";
  status_message = white_resigned ? "White resigned" : "Black resigned";

  if (resign_overlay != nullptr) {
    lv_obj_delete(resign_overlay);
    resign_overlay = nullptr;
  }

  repaint_board();
  show_game_over_overlay();
}

void on_cancel_resign_clicked(lv_event_t *event) {
  (void)event;
  if (resign_overlay != nullptr) {
    lv_obj_delete(resign_overlay);
    resign_overlay = nullptr;
  }
}

void on_confirm_resign_clicked(lv_event_t *event) {
  (void)event;
  finish_by_resignation();
}

void show_resign_confirm_overlay() {
  if (game_over || resign_overlay != nullptr) {
    return;
  }

  lv_obj_t *screen = lv_screen_active();
  resign_overlay = lv_obj_create(screen);
  lv_obj_remove_style_all(resign_overlay);
  lv_obj_set_size(resign_overlay, kScreenPixels, kScreenPixels);
  lv_obj_set_pos(resign_overlay, 0, 0);
  lv_obj_set_style_bg_color(resign_overlay, lv_color_hex(0x11110F), LV_PART_MAIN);
  lv_obj_set_style_bg_opa(resign_overlay, LV_OPA_50, LV_PART_MAIN);
  lv_obj_add_flag(resign_overlay, LV_OBJ_FLAG_CLICKABLE);

  lv_obj_t *panel = lv_obj_create(resign_overlay);
  lv_obj_remove_style_all(panel);
  lv_obj_set_size(panel, 340, 202);
  lv_obj_center(panel);
  lv_obj_set_style_radius(panel, 18, LV_PART_MAIN);
  lv_obj_set_style_bg_color(panel, lv_color_hex(0xF1E1BB), LV_PART_MAIN);
  lv_obj_set_style_bg_opa(panel, LV_OPA_COVER, LV_PART_MAIN);
  lv_obj_set_style_border_width(panel, 4, LV_PART_MAIN);
  lv_obj_set_style_border_color(panel, lv_color_hex(0x34495E), LV_PART_MAIN);

  lv_obj_t *title = lv_label_create(panel);
  lv_label_set_text(title, "Resign?");
  lv_obj_set_style_text_font(title, &lv_font_montserrat_28, LV_PART_MAIN);
  lv_obj_set_style_text_color(title, lv_color_hex(0x263526), LV_PART_MAIN);
  lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 20);

