colus001/board-games-esp32/src/main.cpp
  lv_obj_t *message = lv_label_create(panel);
  lv_label_set_text(message, white_turn ? "White resigns" : "Black resigns");
  lv_obj_set_style_text_font(message, &lv_font_montserrat_20, LV_PART_MAIN);
  lv_obj_set_style_text_color(message, lv_color_hex(0x5E3F2A), LV_PART_MAIN);
  lv_obj_align(message, LV_ALIGN_TOP_MID, 0, 64);

  lv_obj_t *cancel = create_menu_button(panel, "Cancel", 132, 50);
  lv_obj_align(cancel, LV_ALIGN_BOTTOM_LEFT, 28, -22);
  lv_obj_add_event_cb(cancel, on_cancel_resign_clicked, LV_EVENT_CLICKED, nullptr);

  lv_obj_t *resign = create_menu_button(panel, "Resign", 132, 50);
  lv_obj_align(resign, LV_ALIGN_BOTTOM_RIGHT, -28, -22);
  lv_obj_set_style_bg_color(resign, lv_color_hex(0x8A4B3D), LV_PART_MAIN);
  lv_obj_add_event_cb(resign, on_confirm_resign_clicked, LV_EVENT_CLICKED, nullptr);
}

void on_resign_clicked(lv_event_t *event) {
  (void)event;
  show_resign_confirm_overlay();
}

void on_retry_lichess_clicked(lv_event_t *event) {
  (void)event;
  show_lichess_progress_screen();
  update_lichess_progress("Starting...", "Preparing screen");
  lichess_match_pending = true;
  lichess_match_start_at = millis() + 250;
}

void on_cancel_network_clicked(lv_event_t *event) {
  (void)event;
  lichess_match_pending = false;
  WiFi.disconnect(true);
  reset_game();
  show_start_screen();
}

void on_wifi_setup_clicked(lv_event_t *event) {
  (void)event;
  stop_pair_poll_timer();
  show_wifi_scan_screen();
}

void on_lichess_pair_clicked(lv_event_t *event) {
  (void)event;
  show_lichess_pair_screen();
}

void show_lichess_progress_screen() {
  lv_obj_t *screen = lv_screen_active();
  lv_obj_clean(screen);
  network_body_label = nullptr;
  network_detail_label = nullptr;
  lichess_progress_stage_label = nullptr;
  lichess_progress_detail_label = nullptr;
  lichess_progress_log_label = nullptr;
  lichess_progress_log_text = "";
  lv_obj_set_style_bg_color(screen, lv_color_hex(0x17202A), LV_PART_MAIN);

  lv_obj_t *title = lv_label_create(screen);
  lv_label_set_text(title, "Lichess Match");
  lv_obj_set_style_text_font(title, &lv_font_montserrat_28, LV_PART_MAIN);
  lv_obj_set_style_text_color(title, lv_color_hex(0xF8F1DC), LV_PART_MAIN);
  lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 18);

  lv_obj_t *panel = lv_obj_create(screen);
  lv_obj_remove_style_all(panel);
  lv_obj_set_size(panel, 420, 330);
  lv_obj_align(panel, LV_ALIGN_TOP_MID, 0, 64);
  lv_obj_set_style_radius(panel, 22, LV_PART_MAIN);
  lv_obj_set_style_bg_color(panel, lv_color_hex(0xF1E1BB), LV_PART_MAIN);
  lv_obj_set_style_bg_opa(panel, LV_OPA_COVER, LV_PART_MAIN);
  lv_obj_set_style_border_width(panel, 4, LV_PART_MAIN);
  lv_obj_set_style_border_color(panel, lv_color_hex(0x9FBAD0), LV_PART_MAIN);

  lv_obj_t *board_hint = lv_obj_create(panel);
  lv_obj_remove_style_all(board_hint);
  lv_obj_set_size(board_hint, 108, 108);
  lv_obj_align(board_hint, LV_ALIGN_TOP_MID, 0, 18);
  lv_obj_set_style_radius(board_hint, 12, LV_PART_MAIN);
  lv_obj_set_style_bg_color(board_hint, lv_color_hex(0xD9CDAE), LV_PART_MAIN);
  lv_obj_set_style_bg_opa(board_hint, LV_OPA_COVER, LV_PART_MAIN);
  lv_obj_set_style_border_width(board_hint, 2, LV_PART_MAIN);
  lv_obj_set_style_border_color(board_hint, lv_color_hex(0x4F7EA5), LV_PART_MAIN);
  lv_obj_remove_flag(board_hint, LV_OBJ_FLAG_CLICKABLE);

  lv_obj_t *pieces = lv_label_create(board_hint);
  lv_label_set_text(pieces, "♔♜");
  lv_obj_set_style_text_font(pieces, &chess_symbols_42, LV_PART_MAIN);
  lv_obj_set_style_text_color(pieces, lv_color_hex(0x263526), LV_PART_MAIN);
  lv_obj_center(pieces);

  lichess_progress_stage_label = lv_label_create(panel);
  lv_label_set_text(lichess_progress_stage_label, "Starting...");
  lv_obj_set_width(lichess_progress_stage_label, 360);
  lv_obj_set_style_text_font(lichess_progress_stage_label, &lv_font_montserrat_20, LV_PART_MAIN);
  lv_obj_set_style_text_color(lichess_progress_stage_label, lv_color_hex(0x263526), LV_PART_MAIN);
  lv_obj_set_style_text_align(lichess_progress_stage_label, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
  lv_obj_align(lichess_progress_stage_label, LV_ALIGN_TOP_MID, 0, 140);

  lichess_progress_detail_label = lv_label_create(panel);
  lv_label_set_text(lichess_progress_detail_label, "Preparing Lichess flow");
  lv_obj_set_width(lichess_progress_detail_label, 360);
  lv_obj_set_style_text_font(lichess_progress_detail_label, &lv_font_montserrat_14, LV_PART_MAIN);
  lv_obj_set_style_text_color(lichess_progress_detail_label, lv_color_hex(0x5E3F2A), LV_PART_MAIN);
  lv_obj_set_style_text_align(lichess_progress_detail_label, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
  lv_obj_align(lichess_progress_detail_label, LV_ALIGN_TOP_MID, 0, 174);

  lichess_progress_log_label = lv_label_create(panel);
  lv_label_set_text(lichess_progress_log_label, "");
  lv_obj_set_width(lichess_progress_log_label, 360);
  lv_obj_set_style_text_font(lichess_progress_log_label, &lv_font_montserrat_14, LV_PART_MAIN);
  lv_obj_set_style_text_color(lichess_progress_log_label, lv_color_hex(0x34495E), LV_PART_MAIN);
  lv_obj_set_style_text_align(lichess_progress_log_label, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
  lv_obj_align(lichess_progress_log_label, LV_ALIGN_TOP_LEFT, 30, 212);

  lv_obj_t *cancel = create_menu_button(screen, "Cancel", 150, 46);
  lv_obj_align(cancel, LV_ALIGN_BOTTOM_MID, 0, -20);
  lv_obj_add_event_cb(cancel, on_cancel_network_clicked, LV_EVENT_CLICKED, nullptr);

  lv_timer_handler();
}

void show_network_status_screen(const char *title_text, const char *message, const char *detail, bool show_retry) {
  lv_obj_t *screen = lv_screen_active();
  lv_obj_clean(screen);
  network_body_label = nullptr;
  network_detail_label = nullptr;
  lv_obj_set_style_bg_color(screen, lv_color_hex(0x17202A), LV_PART_MAIN);

  lv_obj_t *card = lv_obj_create(screen);
  lv_obj_remove_style_all(card);
  lv_obj_set_size(card, 404, 332);
  lv_obj_center(card);
  lv_obj_set_style_radius(card, 22, LV_PART_MAIN);
  lv_obj_set_style_bg_color(card, lv_color_hex(0xF1E1BB), LV_PART_MAIN);
  lv_obj_set_style_bg_opa(card, LV_OPA_COVER, LV_PART_MAIN);
  lv_obj_set_style_border_width(card, 4, LV_PART_MAIN);
  lv_obj_set_style_border_color(card, lv_color_hex(0x9FBAD0), LV_PART_MAIN);

  lv_obj_t *title = lv_label_create(card);
  lv_label_set_text(title, title_text);
  lv_obj_set_style_text_font(title, &lv_font_montserrat_28, LV_PART_MAIN);
  lv_obj_set_style_text_color(title, lv_color_hex(0x263526), LV_PART_MAIN);
  lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 28);

  lv_obj_t *body = lv_label_create(card);
  network_body_label = body;
  lv_label_set_text(body, message);
  lv_obj_set_width(body, 344);
  lv_obj_set_style_text_font(body, &lv_font_montserrat_20, LV_PART_MAIN);
  lv_obj_set_style_text_color(body, lv_color_hex(0x34495E), LV_PART_MAIN);
  lv_obj_set_style_text_align(body, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
  lv_obj_align(body, LV_ALIGN_TOP_MID, 0, 86);

  lv_obj_t *detail_label = lv_label_create(card);
  network_detail_label = detail_label;
  lv_label_set_text(detail_label, detail);
  lv_obj_set_width(detail_label, 344);
  lv_obj_set_style_text_font(detail_label, &lv_font_montserrat_14, LV_PART_MAIN);
  lv_obj_set_style_text_color(detail_label, lv_color_hex(0x5E3F2A), LV_PART_MAIN);
  lv_obj_set_style_text_align(detail_label, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
  lv_obj_align(detail_label, LV_ALIGN_TOP_MID, 0, 148);

  if (show_retry) {
    lv_obj_t *retry = create_menu_button(card, "Retry", 150, 52);
    lv_obj_align(retry, LV_ALIGN_BOTTOM_LEFT, 36, -24);
    lv_obj_add_event_cb(retry, on_retry_lichess_clicked, LV_EVENT_CLICKED, nullptr);

    lv_obj_t *title_button = create_menu_button(card, "Title", 150, 52);
    lv_obj_align(title_button, LV_ALIGN_BOTTOM_RIGHT, -36, -24);
    lv_obj_add_event_cb(title_button, on_title_clicked, LV_EVENT_CLICKED, nullptr);
  } else {
    lv_obj_t *cancel = create_menu_button(card, "Cancel", 170, 52);
    lv_obj_align(cancel, LV_ALIGN_BOTTOM_MID, 0, -24);
    lv_obj_add_event_cb(cancel, on_cancel_network_clicked, LV_EVENT_CLICKED, nullptr);
  }

  lv_timer_handler();
}

void show_wifi_connect_screen() {
  String detail = String("SSID: ") + configured_wifi_ssid;
  show_network_status_screen("Wi-Fi", "Connecting...", detail.c_str(), false);
}

