colus001/board-games-esp32/src/main.cpp
void show_wifi_failed_screen(const char *reason) {
  show_network_status_screen("Wi-Fi", "Connection failed", reason, true);
}

void on_wifi_network_clicked(lv_event_t *event) {
  const auto id = *static_cast<uint8_t *>(lv_event_get_user_data(event));
  const int index = wifi_page * 6 + id;
  if (index < 0 || index >= scanned_network_count) {
    return;
  }
  selected_wifi_ssid = scanned_ssids[index];
  show_wifi_password_screen();
}

void on_wifi_prev_clicked(lv_event_t *event) {
  (void)event;
  if (wifi_page > 0) {
    --wifi_page;
  }
  show_wifi_scan_results_screen();
}

void on_wifi_next_clicked(lv_event_t *event) {
  (void)event;
  if ((wifi_page + 1) * 6 < scanned_network_count) {
    ++wifi_page;
  }
  show_wifi_scan_results_screen();
}

void on_wifi_rescan_clicked(lv_event_t *event) {
  (void)event;
  show_wifi_scan_screen();
}

void on_wifi_password_back_clicked(lv_event_t *event) {
  (void)event;
  show_wifi_scan_results_screen();
}

void on_wifi_password_connect_clicked(lv_event_t *event) {
  (void)event;
  const char *password = lv_textarea_get_text(wifi_password_textarea);
  save_config(selected_wifi_ssid, password ? password : "", configured_lichess_token);
  WiFi.disconnect(true);
  show_wifi_connect_screen();
  if (connect_wifi()) {
    show_start_screen();
  } else {
    show_wifi_password_screen();
  }
}

void show_wifi_scan_screen() {
  lv_obj_t *screen = lv_screen_active();
  lv_obj_clean(screen);
  lv_obj_set_style_bg_color(screen, lv_color_hex(0x17202A), LV_PART_MAIN);

  lv_obj_t *card = lv_obj_create(screen);
  lv_obj_remove_style_all(card);
  lv_obj_set_size(card, 410, 356);
  lv_obj_center(card);
  lv_obj_set_style_radius(card, 22, LV_PART_MAIN);
  lv_obj_set_style_bg_color(card, lv_color_hex(0xF1E1BB), LV_PART_MAIN);
  lv_obj_set_style_bg_opa(card, LV_OPA_COVER, LV_PART_MAIN);
  lv_obj_set_style_border_width(card, 4, LV_PART_MAIN);
  lv_obj_set_style_border_color(card, lv_color_hex(0x9FBAD0), LV_PART_MAIN);

  lv_obj_t *title = lv_label_create(card);
  lv_label_set_text(title, "Wi-Fi Scan");
  lv_obj_set_style_text_font(title, &lv_font_montserrat_28, LV_PART_MAIN);
  lv_obj_set_style_text_color(title, lv_color_hex(0x263526), LV_PART_MAIN);
  lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 24);

  lv_obj_t *body = lv_label_create(card);
  lv_label_set_text(body, "Scanning nearby networks...");
  lv_obj_set_width(body, 350);
  lv_obj_set_style_text_font(body, &lv_font_montserrat_20, LV_PART_MAIN);
  lv_obj_set_style_text_color(body, lv_color_hex(0x34495E), LV_PART_MAIN);
  lv_obj_set_style_text_align(body, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
  lv_obj_align(body, LV_ALIGN_CENTER, 0, -14);

  lv_timer_handler();

  WiFi.mode(WIFI_STA);
  WiFi.disconnect(false);
  const int found = WiFi.scanNetworks();
  scanned_network_count = found > 0 ? min(found, 20) : 0;
  for (int i = 0; i < scanned_network_count; ++i) {
    scanned_ssids[i] = WiFi.SSID(i);
    scanned_rssi[i] = WiFi.RSSI(i);
  }
  WiFi.scanDelete();
  wifi_page = 0;
  show_wifi_scan_results_screen();
}

void show_wifi_scan_results_screen() {
  lv_obj_t *screen = lv_screen_active();
  lv_obj_clean(screen);
  lv_obj_set_style_bg_color(screen, lv_color_hex(0x17202A), LV_PART_MAIN);

  lv_obj_t *card = lv_obj_create(screen);
  lv_obj_remove_style_all(card);
  lv_obj_set_size(card, 430, 432);
  lv_obj_center(card);
  lv_obj_set_style_radius(card, 22, LV_PART_MAIN);
  lv_obj_set_style_bg_color(card, lv_color_hex(0xF1E1BB), LV_PART_MAIN);
  lv_obj_set_style_bg_opa(card, LV_OPA_COVER, LV_PART_MAIN);
  lv_obj_set_style_border_width(card, 4, LV_PART_MAIN);
  lv_obj_set_style_border_color(card, lv_color_hex(0x9FBAD0), LV_PART_MAIN);

  lv_obj_t *title = lv_label_create(card);
  lv_label_set_text(title, "Select Wi-Fi");
  lv_obj_set_style_text_font(title, &lv_font_montserrat_28, LV_PART_MAIN);
  lv_obj_set_style_text_color(title, lv_color_hex(0x263526), LV_PART_MAIN);
  lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 18);

  if (scanned_network_count == 0) {
    lv_obj_t *empty = lv_label_create(card);
    lv_label_set_text(empty, "No networks found");
    lv_obj_set_style_text_font(empty, &lv_font_montserrat_20, LV_PART_MAIN);
    lv_obj_set_style_text_color(empty, lv_color_hex(0x34495E), LV_PART_MAIN);
    lv_obj_align(empty, LV_ALIGN_CENTER, 0, -10);
  }

  const int start = wifi_page * 6;
  const int end = min(start + 6, scanned_network_count);
  for (int i = start; i < end; ++i) {
    const int slot = i - start;
    wifi_button_ids[slot] = slot;
    String label = scanned_ssids[i] + "  " + String(scanned_rssi[i]) + " dBm";
    lv_obj_t *network = create_menu_button(card, label.c_str(), 366, 42);
    lv_obj_align(network, LV_ALIGN_TOP_MID, 0, 64 + slot * 48);
    lv_obj_add_event_cb(network, on_wifi_network_clicked, LV_EVENT_CLICKED, &wifi_button_ids[slot]);
  }

  lv_obj_t *prev = create_menu_button(card, "Prev", 96, 44);
  lv_obj_align(prev, LV_ALIGN_BOTTOM_LEFT, 18, -18);
  lv_obj_add_event_cb(prev, on_wifi_prev_clicked, LV_EVENT_CLICKED, nullptr);

  lv_obj_t *rescan = create_menu_button(card, "Rescan", 118, 44);
  lv_obj_align(rescan, LV_ALIGN_BOTTOM_MID, 0, -18);
  lv_obj_add_event_cb(rescan, on_wifi_rescan_clicked, LV_EVENT_CLICKED, nullptr);

  lv_obj_t *next = create_menu_button(card, "Next", 96, 44);
  lv_obj_align(next, LV_ALIGN_BOTTOM_RIGHT, -18, -18);
  lv_obj_add_event_cb(next, on_wifi_next_clicked, LV_EVENT_CLICKED, nullptr);
}

void show_wifi_password_screen() {
  lv_obj_t *screen = lv_screen_active();
  lv_obj_clean(screen);
  lv_obj_set_style_bg_color(screen, lv_color_hex(0x17202A), LV_PART_MAIN);

  lv_obj_t *title = lv_label_create(screen);
  String title_text = String("Password for ") + selected_wifi_ssid;
  lv_label_set_text(title, title_text.c_str());
  lv_obj_set_width(title, 440);
  lv_obj_set_style_text_font(title, &lv_font_montserrat_20, LV_PART_MAIN);
  lv_obj_set_style_text_color(title, lv_color_hex(0xF8FAFC), LV_PART_MAIN);
  lv_obj_set_style_text_align(title, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
  lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 14);

  wifi_password_textarea = lv_textarea_create(screen);
  lv_obj_set_size(wifi_password_textarea, 420, 54);
  lv_obj_align(wifi_password_textarea, LV_ALIGN_TOP_MID, 0, 52);
  lv_textarea_set_password_mode(wifi_password_textarea, true);
  lv_textarea_set_one_line(wifi_password_textarea, true);
  lv_textarea_set_placeholder_text(wifi_password_textarea, "Wi-Fi password");

  lv_obj_t *back = create_menu_button(screen, "Back", 130, 46);
  lv_obj_align(back, LV_ALIGN_TOP_LEFT, 30, 118);
  lv_obj_add_event_cb(back, on_wifi_password_back_clicked, LV_EVENT_CLICKED, nullptr);

