colus001/board-games-esp32/src/main.cpp
  lv_obj_t *connect = create_menu_button(screen, "Connect", 170, 46);
  lv_obj_align(connect, LV_ALIGN_TOP_RIGHT, -30, 118);
  lv_obj_add_event_cb(connect, on_wifi_password_connect_clicked, LV_EVENT_CLICKED, nullptr);

  lv_obj_t *keyboard = lv_keyboard_create(screen);
  lv_obj_set_size(keyboard, 480, 290);
  lv_obj_align(keyboard, LV_ALIGN_BOTTOM_MID, 0, 0);
  lv_keyboard_set_textarea(keyboard, wifi_password_textarea);
  lv_keyboard_set_mode(keyboard, LV_KEYBOARD_MODE_TEXT_LOWER);
}

void on_pair_poll_timer(lv_timer_t *timer) {
  (void)timer;
  if (pair_device_id.length() == 0) {
    return;
  }
  const String body = pairing_status_body();
  if (body.length() == 0) {
    if (pair_status_label) {
      lv_label_set_text(pair_status_label, "Connection error. Retrying...");
    }
    return;
  }

  if (json_has_status(body, "pending")) {
    if (pair_status_label) {
      lv_label_set_text(pair_status_label, "Waiting for Lichess approval...");
    }
    return;
  }

  if (json_has_status(body, "expired")) {
    stop_pair_poll_timer();
    if (pair_status_label) {
      lv_label_set_text(pair_status_label, "Code expired. Tap Login again.");
    }
    return;
  }

  if (!json_has_status(body, "linked")) {
    if (pair_status_label) {
      lv_label_set_text(pair_status_label, "Unexpected response. Retrying...");
    }
    return;
  }

  const String token = json_string_value(body, "accessToken");
  const String username = json_string_value(body, "username");
  if (token.length() == 0) {
    if (pair_status_label) {
      lv_label_set_text(pair_status_label, "Linked, but token was missing.");
    }
    return;
  }

  stop_pair_poll_timer();
  save_config(configured_wifi_ssid, configured_wifi_password, token);
  lichess_username = username;
  show_start_screen();
}

void show_lichess_pair_screen() {
  stop_pair_poll_timer();
  lv_obj_t *screen = lv_screen_active();
  lv_obj_clean(screen);
  lv_obj_set_style_bg_color(screen, lv_color_hex(0x17202A), LV_PART_MAIN);

  lv_obj_t *card = lv_obj_create(screen);
  lv_obj_remove_style_all(card);
  lv_obj_set_size(card, 428, 400);
  lv_obj_center(card);
  lv_obj_set_style_radius(card, 22, LV_PART_MAIN);
  lv_obj_set_style_bg_color(card, lv_color_hex(0xF1E1BB), LV_PART_MAIN);
  lv_obj_set_style_bg_opa(card, LV_OPA_COVER, LV_PART_MAIN);
  lv_obj_set_style_border_width(card, 4, LV_PART_MAIN);
  lv_obj_set_style_border_color(card, lv_color_hex(0x9FBAD0), LV_PART_MAIN);

  lv_obj_t *title = lv_label_create(card);
  lv_label_set_text(title, "Lichess Login");
  lv_obj_set_style_text_font(title, &lv_font_montserrat_28, LV_PART_MAIN);
  lv_obj_set_style_text_color(title, lv_color_hex(0x263526), LV_PART_MAIN);
  lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 20);

  pair_status_label = lv_label_create(card);
  lv_label_set_text(pair_status_label, "Starting secure login...");
  lv_obj_set_width(pair_status_label, 360);
  lv_obj_set_style_text_font(pair_status_label, &lv_font_montserrat_20, LV_PART_MAIN);
  lv_obj_set_style_text_color(pair_status_label, lv_color_hex(0x34495E), LV_PART_MAIN);
  lv_obj_set_style_text_align(pair_status_label, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
  lv_obj_align(pair_status_label, LV_ALIGN_TOP_MID, 0, 76);

  lv_timer_handler();

  if (!wifi_configured()) {
    lv_label_set_text(pair_status_label, "Set up Wi-Fi first.");
  } else if (String(PAIRING_BASE_URL).length() == 0) {
    lv_label_set_text(pair_status_label, "PAIRING_BASE_URL is missing.");
  } else if (!connect_wifi()) {
    lv_label_set_text(pair_status_label, "Wi-Fi connection failed.");
  } else {
    String pair_code;
    String pair_url;
    if (start_pairing_session(pair_device_id, pair_code, pair_url)) {
      lv_label_set_text(pair_status_label, "Open this on your phone:");

      lv_obj_t *url = lv_label_create(card);
      lv_label_set_text(url, pair_url.c_str());
      lv_obj_set_width(url, 370);
      lv_obj_set_style_text_font(url, &lv_font_montserrat_14, LV_PART_MAIN);
      lv_obj_set_style_text_color(url, lv_color_hex(0x5E3F2A), LV_PART_MAIN);
      lv_obj_set_style_text_align(url, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
      lv_obj_align(url, LV_ALIGN_TOP_MID, 0, 134);

      lv_obj_t *code = lv_label_create(card);
      lv_label_set_text(code, pair_code.c_str());
      lv_obj_set_style_text_font(code, &lv_font_montserrat_28, LV_PART_MAIN);
      lv_obj_set_style_text_color(code, lv_color_hex(0x263526), LV_PART_MAIN);
      lv_obj_align(code, LV_ALIGN_CENTER, 0, 34);

      lv_obj_t *hint = lv_label_create(card);
      lv_label_set_text(hint, "Approve board:play on Lichess.\nThe board will finish automatically.");
      lv_obj_set_width(hint, 360);
      lv_obj_set_style_text_font(hint, &lv_font_montserrat_14, LV_PART_MAIN);
      lv_obj_set_style_text_color(hint, lv_color_hex(0x34495E), LV_PART_MAIN);
      lv_obj_set_style_text_align(hint, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
      lv_obj_align(hint, LV_ALIGN_BOTTOM_MID, 0, -82);

      pair_poll_timer = lv_timer_create(on_pair_poll_timer, 2500, nullptr);
    } else {
      lv_label_set_text(pair_status_label, "Could not start login.");
    }
  }

  lv_obj_t *wifi = create_menu_button(card, "Wi-Fi", 116, 48);
  lv_obj_align(wifi, LV_ALIGN_BOTTOM_LEFT, 28, -22);
  lv_obj_add_event_cb(wifi, on_wifi_setup_clicked, LV_EVENT_CLICKED, nullptr);

  lv_obj_t *retry = create_menu_button(card, "Retry", 116, 48);
  lv_obj_align(retry, LV_ALIGN_BOTTOM_MID, 0, -22);
  lv_obj_add_event_cb(retry, on_lichess_pair_clicked, LV_EVENT_CLICKED, nullptr);

  lv_obj_t *title_button = create_menu_button(card, "Title", 116, 48);
  lv_obj_align(title_button, LV_ALIGN_BOTTOM_RIGHT, -28, -22);
  lv_obj_add_event_cb(title_button, on_title_clicked, LV_EVENT_CLICKED, nullptr);
}

void show_lichess_error_screen(const char *reason) {
  show_network_status_screen("Lichess", "Cannot continue", reason, true);
}

void begin_lichess_match() {
  if (!lichess_progress_stage_label) {
    show_lichess_progress_screen();
  }
  update_lichess_progress("Starting...", "Checking saved settings");
  pump_ui(120);

  if (!wifi_configured()) {
    lichess_log("Wi-Fi is not configured");
    show_wifi_scan_screen();
    return;
  }

  if (!lichess_token_configured()) {
    lichess_log("Lichess login is missing");
    show_lichess_pair_screen();
    return;
  }

