colus001/board-games-esp32/src/main.cpp
  update_lichess_progress("Connecting Wi-Fi...", configured_wifi_ssid.c_str());
  if (!connect_wifi()) {
    show_wifi_failed_screen("Check SSID, password, or signal strength");
    return;
  }
  update_lichess_progress("Wi-Fi connected", WiFi.localIP().toString().c_str());

  update_lichess_progress("Checking account...", "Validating Lichess token");
  if (!load_lichess_account()) {
    show_lichess_error_screen("Token failed. Need board:play scope.");
    return;
  }
  update_lichess_progress("Account OK", lichess_username.c_str());

  update_lichess_progress("Finding match...", "Casual 10+0 rapid");
  const SeekResult seek_result = seek_lichess_game();
  if (seek_result.status != SeekStatus::Matched) {
    String detail = seek_result.detail;
    if (detail.length() == 0 && seek_result.http_code != 0) {
      detail = String("HTTP ") + String(seek_result.http_code);
    }
    if (detail.length() == 0) {
      detail = "Check Wi-Fi, token, or Lichess status";
    }
    show_network_status_screen("Finding Match", seek_status_text(seek_result), detail.c_str(), true);
    return;
  }
  lichess_game_id = seek_result.game_id;
  update_lichess_progress("Game found", lichess_game_id.c_str());

  reset_board_position();
  clear_selection();
  game_over = false;
  game_mode = GameMode::Lichess;
  white_turn = true;
  lichess_last_moves = "";
  set_dynamic_status(String("Game found | You: ") + (lichess_is_white ? "White" : "Black"));
  update_lichess_progress("Opening game stream...", lichess_is_white ? "You are White" : "You are Black");
  create_chessboard();
  if (!connect_lichess_stream()) {
    if (lichess_stream_error_detail.length() > 0) {
      status_message = lichess_stream_error_detail.c_str();
    } else {
      status_message = "Lichess stream failed";
    }
    repaint_board();
  }
}

void on_lichess_match_clicked(lv_event_t *event) {
  (void)event;
  show_lichess_progress_screen();
  update_lichess_progress("Starting...", "Preparing screen");
  lichess_match_pending = true;
  lichess_match_start_at = millis() + 250;
}

void on_square_clicked(lv_event_t *event) {
  if (game_over) {
    return;
  }

  if (game_mode == GameMode::Lichess && !lichess_my_turn) {
    set_lichess_turn_status();
    repaint_board();
    return;
  }

  if (game_mode == GameMode::Ai && !white_turn) {
    status_message = "AI thinking...";
    repaint_board();
    return;
  }

  const auto id = *static_cast<uint8_t *>(lv_event_get_user_data(event));
  const int row = id / 8;
  const int col = id % 8;
  const char touched_piece = board[row][col];

  if (selected_row < 0) {
    if (is_current_turn_piece(touched_piece)) {
      select_square(row, col);
    } else {
      status_message = white_turn ? "White to move" : "Black to move";
    }
    repaint_board();
    return;
  }

  if (row == selected_row && col == selected_col) {
    clear_selection();
    set_turn_status();
    repaint_board();
    return;
  }

  if (is_current_turn_piece(touched_piece)) {
    select_square(row, col);
    repaint_board();
    return;
  }

  if (is_legal_move(selected_row, selected_col, row, col)) {
    if (game_mode == GameMode::Lichess) {
      const String uci = uci_from_move(selected_row, selected_col, row, col);
      Serial.printf("Sending Lichess move: %s\n", uci.c_str());
      set_dynamic_status(String("Sending ") + uci + "...");
      repaint_board();
      if (lichess_post(String("/api/board/game/") + lichess_game_id + "/move/" + uci)) {
        clear_selection();
        lichess_my_turn = false;
        lichess_pending_uci = uci;
        lichess_pending_since = millis();
        set_dynamic_status(String("Move sent ") + uci + " | Waiting sync");
      } else {
        if (lichess_move_error_detail.length() > 0) {
          set_dynamic_status(String("Move failed ") + uci + " | " + lichess_move_error_detail);
        } else {
          set_dynamic_status(String("Move failed ") + uci);
        }
      }
    } else {
      move_piece(selected_row, selected_col, row, col);
      make_ai_move_if_needed();
    }
  } else {
    status_message = "Illegal move";
  }

  repaint_board();
  if (game_over) {
    show_game_over_overlay();
  }
}

void show_start_screen() {
  stop_pair_poll_timer();
  lv_obj_t *screen = lv_screen_active();
  lv_obj_clean(screen);
  lv_obj_set_style_bg_color(screen, lv_color_hex(0x17202A), LV_PART_MAIN);

  lv_obj_t *card = lv_obj_create(screen);
  lv_obj_remove_style_all(card);
  lv_obj_set_size(card, 424, 432);
  lv_obj_center(card);
  lv_obj_set_style_radius(card, 24, LV_PART_MAIN);
  lv_obj_set_style_bg_color(card, lv_color_hex(0xF1E1BB), LV_PART_MAIN);
  lv_obj_set_style_bg_opa(card, LV_OPA_COVER, LV_PART_MAIN);
  lv_obj_set_style_border_width(card, 4, LV_PART_MAIN);
  lv_obj_set_style_border_color(card, lv_color_hex(0x9FBAD0), LV_PART_MAIN);

  lv_obj_t *title = lv_label_create(card);
  lv_label_set_text(title, "Local Chess");
  lv_obj_set_style_text_font(title, &lv_font_montserrat_28, LV_PART_MAIN);
  lv_obj_set_style_text_color(title, lv_color_hex(0x263526), LV_PART_MAIN);
  lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 20);

  lv_obj_t *subtitle = lv_label_create(card);
  lv_label_set_text(subtitle, "Touch chess on ESP32");
  lv_obj_set_style_text_font(subtitle, &lv_font_montserrat_20, LV_PART_MAIN);
  lv_obj_set_style_text_color(subtitle, lv_color_hex(0x5E3F2A), LV_PART_MAIN);
  lv_obj_align(subtitle, LV_ALIGN_TOP_MID, 0, 64);

  lv_obj_t *pieces = lv_label_create(card);
  lv_label_set_text(pieces, "♔♕♖♚♛♜");
  lv_obj_set_style_text_font(pieces, &chess_symbols_42, LV_PART_MAIN);
  lv_obj_set_style_text_color(pieces, lv_color_hex(0x263526), LV_PART_MAIN);
  lv_obj_align(pieces, LV_ALIGN_TOP_MID, 0, 106);

  lv_obj_t *local = create_menu_button(card, "Local Game", 168, 56);
  lv_obj_align(local, LV_ALIGN_TOP_LEFT, 28, 164);
  lv_obj_add_event_cb(local, on_start_clicked, LV_EVENT_CLICKED, nullptr);

  lv_obj_t *ai = create_menu_button(card, "AI Game", 168, 56);
  lv_obj_align(ai, LV_ALIGN_TOP_RIGHT, -28, 164);
  lv_obj_add_event_cb(ai, on_ai_game_clicked, LV_EVENT_CLICKED, nullptr);

  lv_obj_t *lichess = create_menu_button(card, "Lichess", 168, 54);
  lv_obj_align(lichess, LV_ALIGN_TOP_LEFT, 28, 234);
  lv_obj_add_event_cb(lichess, on_lichess_match_clicked, LV_EVENT_CLICKED, nullptr);

  lv_obj_t *setup = create_menu_button(card, "Wi-Fi Setup", 168, 52);
  lv_obj_align(setup, LV_ALIGN_TOP_RIGHT, -28, 234);
  lv_obj_add_event_cb(setup, on_wifi_setup_clicked, LV_EVENT_CLICKED, nullptr);

  lv_obj_t *login = create_menu_button(card, "Lichess Login", 364, 52);
  lv_obj_align(login, LV_ALIGN_TOP_MID, 0, 304);
  lv_obj_add_event_cb(login, on_lichess_pair_clicked, LV_EVENT_CLICKED, nullptr);

