colus001/board-games-esp32/src/main.cpp
  lv_obj_t *hint = lv_label_create(card);
  String readiness = String("Wi-Fi: ") + configured_text(wifi_configured()) + "  Lichess: " + configured_text(lichess_token_configured());
  lv_label_set_text(hint, readiness.c_str());
  lv_obj_set_style_text_font(hint, &lv_font_montserrat_14, LV_PART_MAIN);
  lv_obj_set_style_text_color(hint, lv_color_hex(0x34495E), LV_PART_MAIN);
  lv_obj_align(hint, LV_ALIGN_BOTTOM_MID, 0, -16);
}

void create_chessboard() {
  Serial.println("Creating chessboard UI");
#ifdef BOARD_HAS_TOUCH
  touch_calibration_data.valid = false;
#endif

  lv_obj_t *screen = lv_screen_active();
  lv_obj_clean(screen);
  lv_obj_set_style_bg_color(screen, lv_color_hex(0x17202A), LV_PART_MAIN);

  board_frame = lv_obj_create(screen);
  lv_obj_remove_style_all(board_frame);
  lv_obj_set_size(board_frame, kBoardPixels, kBoardPixels);
  lv_obj_set_pos(board_frame, kBoardOffsetX, kBoardOffsetY);
  lv_obj_set_style_bg_color(board_frame, lv_color_hex(0xEEEED2), LV_PART_MAIN);
  lv_obj_set_style_bg_opa(board_frame, LV_OPA_COVER, LV_PART_MAIN);
  lv_obj_set_style_border_width(board_frame, 0, LV_PART_MAIN);
  lv_obj_remove_flag(board_frame, LV_OBJ_FLAG_CLICKABLE);

  for (int row = 0; row < 8; ++row) {
    for (int col = 0; col < 8; ++col) {
      const int id = row * 8 + col;
      const int display_row = board_to_display_row(row);
      const int display_col = board_to_display_col(col);
      square_ids[id] = id;

      lv_obj_t *square = lv_obj_create(board_frame);
      squares[row][col] = square;
      lv_obj_remove_style_all(square);
      lv_obj_set_size(square, kSquarePixels, kSquarePixels);
      lv_obj_set_pos(square, display_col * kSquarePixels, display_row * kSquarePixels);
      lv_obj_set_style_radius(square, 0, LV_PART_MAIN);
      lv_obj_add_flag(square, LV_OBJ_FLAG_CLICKABLE);
      lv_obj_add_event_cb(square, on_square_clicked, LV_EVENT_CLICKED, &square_ids[id]);

      lv_obj_t *marker = lv_obj_create(square);
      move_markers[row][col] = marker;
      lv_obj_remove_style_all(marker);
      lv_obj_add_flag(marker, LV_OBJ_FLAG_HIDDEN);
      lv_obj_remove_flag(marker, LV_OBJ_FLAG_CLICKABLE);

      lv_obj_t *label = lv_label_create(square);
      piece_labels[row][col] = label;
      lv_obj_set_style_text_font(label, &chess_symbols_42, LV_PART_MAIN);
      lv_obj_remove_flag(label, LV_OBJ_FLAG_CLICKABLE);
      lv_obj_center(label);

      if (display_col == 0) {
        lv_obj_t *rank = lv_label_create(square);
        rank_labels[row] = rank;
        lv_label_set_text_fmt(rank, "%d", 8 - row);
        lv_obj_set_style_text_font(rank, &lv_font_montserrat_14, LV_PART_MAIN);
        lv_obj_align(rank, LV_ALIGN_TOP_LEFT, 3, 1);
        lv_obj_remove_flag(rank, LV_OBJ_FLAG_CLICKABLE);
      }

      if (display_row == 7) {
        lv_obj_t *file = lv_label_create(square);
        file_labels[col] = file;
        lv_label_set_text_fmt(file, "%c", 'a' + col);
        lv_obj_set_style_text_font(file, &lv_font_montserrat_14, LV_PART_MAIN);
        lv_obj_align(file, LV_ALIGN_BOTTOM_RIGHT, -3, -1);
        lv_obj_remove_flag(file, LV_OBJ_FLAG_CLICKABLE);
      }
    }
  }

  status_label = lv_label_create(screen);
  lv_obj_set_width(status_label, 372);
  lv_obj_set_style_bg_color(status_label, lv_color_hex(0x17202A), LV_PART_MAIN);
  lv_obj_set_style_bg_opa(status_label, LV_OPA_COVER, LV_PART_MAIN);
  lv_obj_set_style_text_color(status_label, lv_color_hex(0xF8FAFC), LV_PART_MAIN);
  lv_obj_set_style_text_align(status_label, LV_TEXT_ALIGN_LEFT, LV_PART_MAIN);
  lv_obj_set_pos(status_label, 12, kHudOffsetY + 7);
  lv_obj_remove_flag(status_label, LV_OBJ_FLAG_CLICKABLE);

  lv_obj_t *resign_button = create_small_button(screen, "Resign", 84, 24);
  lv_obj_set_pos(resign_button, kScreenPixels - 94, kHudOffsetY + 4);
  lv_obj_add_event_cb(resign_button, on_resign_clicked, LV_EVENT_CLICKED, nullptr);

  repaint_board();
  Serial.println("Chessboard UI created");
}
} // namespace

void setup() {
  Serial.begin(115200);
  Serial.println("ESP32-S3 local chess starting");

  smartdisplay_init();
  smartdisplay_lcd_set_backlight(1.0f);

  auto display = lv_display_get_default();
  lv_display_set_rotation(display, LV_DISPLAY_ROTATION_0);

  load_config();
  reset_game();
  show_start_screen();
}

void loop() {
  static auto lv_last_tick = millis();
  const auto now = millis();

  lv_tick_inc(now - lv_last_tick);
  lv_last_tick = now;
  lv_timer_handler();

  if (lichess_match_pending && now >= lichess_match_start_at) {
    lichess_match_pending = false;
    begin_lichess_match();
  }

  poll_lichess_stream();

  delay(5);
}
